[Killed] PublicVisibility
Aposentadoria/Models/Usuario.php:18:2
  /*
   * @return bool 
   * */
- public function checkIsRetired(): bool
+ protected function checkIsRetired() : bool
  {
     return $this->tempoDeTrabalho >= 30 || $this->idade >= 65;
killedBy: Src\Tests\Models\UsuarioTest::testShouldBeTired
statusReason: 1) Src\Tests\Models\UsuarioTest::testShouldBeTired
Error: Call to protected method Src\Aposentadoria\Models\Usuario::checkIsRetired() from scope Src\Tests\Models\UsuarioTest

/home/nathan/dev/mutation-testing/src/Tests/Models/UsuarioTest.php:15

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalOrAllSubExprNegation
Aposentadoria/Models/Usuario.php:20:5
   * */
  public function checkIsRetired(): bool
  {
-    return $this->tempoDeTrabalho >= 30 || $this->idade >= 65;
+    return !($this->tempoDeTrabalho >= 30) || !($this->idade >= 65);
  }
 }
killedBy: Src\Tests\Models\UsuarioTest::testShouldBeTired
statusReason: 1) Src\Tests\Models\UsuarioTest::testShouldBeTired
Failed asserting that false is true.

/home/nathan/dev/mutation-testing/src/Tests/Models/UsuarioTest.php:15

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalOrNegation
Aposentadoria/Models/Usuario.php:20:5
   * */
  public function checkIsRetired(): bool
  {
-    return $this->tempoDeTrabalho >= 30 || $this->idade >= 65;
+    return !($this->tempoDeTrabalho >= 30 || $this->idade >= 65);
  }
 }
killedBy: Src\Tests\Models\UsuarioTest::testShouldBeTired
statusReason: 1) Src\Tests\Models\UsuarioTest::testShouldBeTired
Failed asserting that false is true.

/home/nathan/dev/mutation-testing/src/Tests/Models/UsuarioTest.php:15

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
