[Killed] GreaterThanOrEqualToNegotiation
Aposentadoria/Models/Usuario.php:20:5
   * */
  public function checkIsRetired(): bool
  {
-    return $this->tempoDeTrabalho >= 30 || $this->idade >= 65;
+    return $this->tempoDeTrabalho >= 30 || $this->idade < 65;
  }
 }
killedBy: Src\Tests\Models\UsuarioTest::testCheckIsRetiredWhenOnlyAgeIsEnough
statusReason: 1) Src\Tests\Models\UsuarioTest::testCheckIsRetiredWhenOnlyAgeIsEnough
Failed asserting that false is true.

/home/nathan/dev/mutation-testing/src/Tests/Models/UsuarioTest.php:47

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
